<template>
  <div class="wrapper">
    <div class="content">
      <h2>这是第1</h2>
      <h2>这是第2</h2>
      <h2>这是第3</h2>
      <h2>这是第4</h2>
      <h2>这是第5</h2>
      <h2>这是第6</h2>
      <h2>这是第7</h2>
      <h2>这是第8</h2>
      <h2>这是第9</h2>
      <h2>这是第10</h2>
      <h2>这是第11</h2>
      <h2>这是第12</h2>
      <h2>这是第13</h2>
      <h2>这是第14</h2>
      <h2>这是第15</h2>
      <h2>这是第16</h2>
      <h2>这是第17</h2>
      <h2>这是第18</h2>
      <h2>这是第19</h2>
      <h2>这是第20</h2>
      <h2>这是第21</h2>
      <h2>这是第22</h2>
      <h2>这是第23</h2>
      <h2>这是第24</h2>
      <h2>这是第25</h2>
      <h2>这是第26</h2>
      <h2>这是第27</h2>
      <h2>这是第28</h2>
      <h2>这是第29</h2>
      <h2>这是第30</h2>
      <h2>这是第31</h2>
      <h2>这是第32</h2>
      <h2>这是第33</h2>
      <h2>这是第34</h2>
      <h2>这是第35</h2>
      <h2>这是第36</h2>
      <h2>这是第37</h2>
      <h2>这是第38</h2>
      <h2>这是第39</h2>
      <h2>这是第40</h2>
      <h2>这是第41</h2>
      <h2>这是第42</h2>
      <h2>这是第43</h2>
      <h2>这是第44</h2>
      <h2>这是第45</h2>
      <h2>这是第46</h2>
      <h2>这是第47</h2>
      <h2>这是第48</h2>
      <h2>这是第49</h2>
      <h2>这是第50</h2>
      <h2>这是第51</h2>
      <h2>这是第52</h2>
      <h2>这是第53</h2>
      <h2>这是第54</h2>
      <h2>这是第55</h2>
      <h2>这是第56</h2>
      <h2>这是第57</h2>
      <h2>这是第58</h2>
      <h2>这是第59</h2>
      <h2>这是第60</h2>
      <h2>这是第61</h2>
      <h2>这是第62</h2>
      <h2>这是第63</h2>
      <h2>这是第64</h2>
      <h2>这是第65</h2>
      <h2>这是第66</h2>
      <h2>这是第67</h2>
      <h2>这是第68</h2>
      <h2>这是第69</h2>
      <h2>这是第70</h2>
      <h2>这是第71</h2>
      <h2>这是第72</h2>
      <h2>这是第73</h2>
      <h2>这是第74</h2>
      <h2>这是第75</h2>
      <h2>这是第76</h2>
      <h2>这是第77</h2>
      <h2>这是第78</h2>
      <h2>这是第79</h2>
      <h2>这是第80</h2>
      <h2>这是第81</h2>
      <h2>这是第82</h2>
      <h2>这是第83</h2>
      <h2>这是第84</h2>
      <h2>这是第85</h2>
      <h2>这是第86</h2>
      <h2>这是第87</h2>
      <h2>这是第88</h2>
      <h2>这是第89</h2>
      <h2>这是第90</h2>
      <h2>这是第91</h2>
      <h2>这是第92</h2>
      <h2>这是第93</h2>
      <h2>这是第94</h2>
      <h2>这是第95</h2>
      <h2>这是第96</h2>
      <h2>这是第97</h2>
      <h2>这是第98</h2>
      <h2>这是第99</h2>
      <h2>这是第100</h2>
    </div>
  </div>
</template>

<script>
  import BScroll from "better-scroll"
    export default {
        name: "Category",
        data(){
          return{
            scroll:null
          }
        },
        mounted() {
          this.scroll=new BScroll(document.querySelector(".wrapper"),{
            prototype:3,
            // 上拉加载更多
            pullUpLoad:true
          })
          this.scroll.on('scroll',(position)=>{
            console.log(position);
          })
          this.scroll.on("pullingUp",()=>{

          })
      }
    }
</script>

<style scoped>
  .wrapper{
    width: 100px;
    height: 100px;
    background-color: red;
  }
</style>
